---
title: WallJoinRoofFailures
classe: Autodesk.Revit.DB.BuiltInFailures+WallJoinRoofFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# WallJoinRoofFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId NoFromRoofForWall { get; }` | `WallJoinRoofFailures.NoFromRoofForWall` | FailureDefinitionId |
| `FailureDefinitionId NotCoveredAtAllByTarget { get; }` | `WallJoinRoofFailures.NotCoveredAtAllByTarget` | FailureDefinitionId |
| `FailureDefinitionId NoUptoRoofForWall { get; }` | `WallJoinRoofFailures.NoUptoRoofForWall` | FailureDefinitionId |
| `FailureDefinitionId WallMeetsRoofTangentially { get; }` | `WallJoinRoofFailures.WallMeetsRoofTangentially` | FailureDefinitionId |
| `FailureDefinitionId WallNotCoveredByRoof { get; }` | `WallJoinRoofFailures.WallNotCoveredByRoof` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```